app/controllers/topics_controller.rb

	def index
    	@topics = Topic.paginate(page: params[:page])
---
SELECT "topics".* FROM "topics" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "topics"

  	def show
		@topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "1"]]